from interview_questions.one.main_one import print_sey_hello

"""
Модуль — это файл с расширением .py, который содержит код. Он может содержать переменные, функции и классы, 
которые можно использовать в других программах или модулях.

Модули используются для организации кода, упрощения его поддержки и повторного использования. 
Они позволяют разбить код на отдельные логические блоки, что делает его более структурированным и управляемым.

Модули представляют собой важный механизм организации кода и его повторного использования, 
а также обеспечивают удобство и поддерживаемость проекта.
"""


def calc(a, b):
    print(a + b)


if __name__ == "__main__":
    print_sey_hello(var="Zapel")
